# YOLOv9 with SqueezeNet Block

# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, RepVGG, [64, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, RepVGG, [128, 3, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 2

   # SqueezeNet block (using Fire modules from SqueezeNet)
   [-1, 1, Fire, [256, 64, 128, 128]],  # 3 (Squeeze=64, Expand1x1=128, Expand3x3=128)
   [-1, 1, Fire, [256, 64, 128, 128]],  # 4 (Stacking Fire blocks)
   [-1, 1, Fire, [256, 64, 128, 128]],  # 5

   # avg-conv down
   [-1, 1, ADown, [256]],  # 6-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 7

   # avg-conv down
   [-1, 1, ADown, [512]],  # 8-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9

   # avg-conv down
   [-1, 1, ADown, [512]],  # 10-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 11
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 12

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 15

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 18 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 24 (P5/32-large)

   # detect
   [[18, 21, 24], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)
  ]
